import streamlit as st

st.set_page_config(
    page_title="EduDocs",
    page_icon="📃",
    layout="wide"
)

st.markdown("""
            Edudocs에 오신 것을 환영합니다! \n
            본 서비스는 RAG를 적용한 생성형 AI 기술을 통한 교사 업무의 경감을 목표로 합니다. \n
            정제된 데이터를 기반으로 인공지능 언어모델이 안정적인 결과를 도출해낼 수 있도록 노력하고 있습니다.

            서비스되는 기능은 지속적으로 업데이트 예정입니다.

            현재는 아래 서비스가 이용 가능합니다.(2024. 11. 24.)

            #### 법령 및 규정 
              - 복무 규정 : 교육공무원법 및 공무원복무규정에 해당하는 내용을 검색할 수 있습니다.
              - 초중등 교육법 : 초중등 교육법에 해당하는 내용을 검색할 수 있습니다.
            #### 교육과정
              - 성취기준 : 2022 개정 교육과정의 성취기준을 검색할 수 있습니다. 
            #### 나이스
              - 학생부 기재요령 : 
              - 행발 생성기 : 원하는 특성 및 내용을 조합하여 행동특성 및 종합의견을 생성할 수 있습니다.
              - 과목 누가기록 생성기 : 원하는 과목 및 내용을 조합하여 누가기록 예시를 생성할 수 있습니다.
            #### 에듀파인
              - 공문작성기 : 원하는 주제를 기입하여 그와 연관된 공문 예시를 생성할 수 있습니다.
            #### 수업
              - 깊이있는 수업 단원 설계 : 교과, 역량 및 성취기준을 조합하여 깊이있는 수업의 단원 설계안을 생성할 수 있습니다.
              - 에듀테크 지도안 : 원하는 주제를 기입하면 적절한 에듀테크가 포함된 수업 지도안을 생성할 수 있습니다.

""")

# st.markdown("""
# #### 명확하고 간결한 질문 
# 챗봇에 질문할 때는 가능한 한 구체적이고 명확한 표현을 사용하세요. 단순하고 직접적인 질문일수록 더 정확한 답변을 받을 수 있습니다.

# #### 문맥 제공
# 질문에 대한 더 나은 답변을 원한다면, 필요한 경우 추가적인 배경 정보를 제공해 주세요. 챗봇이 더 많은 맥락을 이해할 수 있게 도와줍니다.

# #### 단계별 질문
# 복잡한 문제를 해결하고 싶다면, 여러 단계로 나누어 질문하세요. 각 단계에서 챗봇의 답변을 참고하며 점진적으로 깊이 있는 답변을 얻을 수 있습니다.

# #### 다양한 표현 시도
# 챗봇이 제공한 답변이 만족스럽지 않을 경우, 질문을 다르게 표현해 보세요. 같은 질문도 표현 방법에 따라 다른 결과를 얻을 수 있습니다.

# #### 반복 질문 피하기
# 동일한 질문을 여러 번 반복하기보다, 답변이 불명확할 경우 추가적인 설명을 요청하거나 질문을 조금 수정해서 다시 시도해 보세요.

# #### 답변 확인 및 검증
# 중요한 결정이나 정보는 챗봇의 답변을 참고하되, 추가적인 검증을 거치세요. 필요할 경우 전문가의 조언을 구하는 것이 좋습니다

# """)
